# ბანკომატი

import json
import sys
users = [{
        "personal_id": "01020304050",
        "name": "გიორგი",
        "lastname": "ბერიძე",
        "password": "1234",
        "balance": 1500.0
    },
    {
        "personal_id": "01050607080",
        "name": "ნინო",
        "lastname": "კაპანაძე",
        "password": "4321",
        "balance": 250.50
    },
    {
        "personal_id": "01090101112",
        "name": "დავით",
        "lastname": "გელაშვილი",
        "password": "1111",
        "balance": 5000.0
    }
]

file = 'users.json'      # შევქმენით json ფაილი და შევიყვანეთ მომხმარებლების მონაცემები
# with open(file, mode='w', encoding='utf-8') as f:
#     json.dump(users, f, indent=2, ensure_ascii=False)

with open(file, mode='r', encoding='utf-8') as f:   # ვკითხულობთ ფაილიდან მონაცემებს,
        data = json.load(f)                         # რადგან ყველა ოპერაციის განსახორციელებლად გვჭირდება


user = None        # სანამ მომხმარებელი სწორ მონაცემებს არ შეიყვანს და სისტემაში არ შევა, მანამდე user არ გვყავს
attempt = 3        # განსაზღვრული გვაქვს მცდელობების რაოდენობა
                   # თუ მომხმარებელმა მონაცემები 3-ჯერ არასწორად შეიყვანა სისტემა მას გამოაგდებს
while user == None:   # სანამ მომხმარებელი მონაცემებს სწორად არ შეიყვანს ციკლი იმუშავებს და სთხოვს მონაცემების შეყვანას
    id = input('გთხოვთ შეიყვანოთ თქვენი პირადი ნომერი: ')
    password = input('გთხოვთ შეიყვანოთ პაროლი: ')

    for i in data:      # ვეძებთ მომხმარებლის შეყვანილ მონაცემებს ჩვენს ბაზაში და თუ დაემთხვა, user-ს დაიმახსოვრებს
        if id == i['personal_id'] and password == i['password']:            # და while ციკლის ოპერატორი გაწყდება
            user = i
            break
    else:
        attempt -= 1      # როდესაც მომხმარებელს მონაცემები არასწორად შეჰყავს 1 მცდელობა აკლდება
        if attempt == 0:    # და თუ მცდელობები ამოეწურა, ანუ 0-ს გაუტოლდა, სისტემა მომხმარებელს გამოაგდებს
            print('თქვენ არასწორად შეიყვანეთ მონაცემები 3-ჯერ, სცადეთ მოგვიანებით')
            sys.exit()
        a = input('თქვენი შეყვანილი პირადი ნომერი ან პაროლი არასწორია, თავიდან საცდელად აირჩიეთ 1, ' \
        'სისტემიდან გასასველად აირჩიეთ 0: ')
        while a != '0' and a != '1':       # სანამ მომხმარებელი არ აირჩევს თავიდან შეიყვანოს მონაცემები თუ გამოვიდეს სისტემიდან
            a = input('გთხოვთ შეიყვანოთ მხოლოდ 1 ან 0: ')                                # while ციკლი იმუშავებს
        if a == '0':
            print('ოპერაცია დასრულებულია')
            sys.exit()


def check_balance(): # მომხმარებელი უკვე დამახსოვრებული გვყავს და ჩვეულებრივად შეგვიძლია შევამოწმოთ მისი ბალანსი ამ ფუნქციით
            print(f'თქვენი ბალანსია: {i['balance']}')


def dep_money():    # ამ ფუნქციით მომხმარებელს შეაქვს თანხა ბალასზე
    deposit = False
    while not deposit:    # სანამ მომხმარებელი ბალანსიდან თანხას არ შეიტანს ან სისტემიდან არ გამოვა while ციკლი იმუშავებს
        money = float(input('შეიყვანეთ ბალანსზე შესატანი თანხა: '))
        if money > 10000:
            print('თქვენს მიერ შეყვანილი თანხა სცდება ლიმიტს, შეგიძლიათ მაქსიმუმ 10000 ლარის შეტანა')
            a = input('თანხის ახლიდან შესაყვანად აირჩიეთ 1, სისტემიდან გასასვლელად აირჩიეთ 0: ')
            while a != '0' and a != '1':     # სანამ მომხმარებელი არ აირჩევს თავიდან შეიყვანოს თანხა თუ გამოვიდეს სისტემიდან
                a = input('გთხოვთ შეიყვანოთ მხოლოდ 1 ან 0: ')                      # while ციკლი იმუშავებს
            if a == '0':
                print('ოპერაცია დასრულებულია')
                sys.exit()
    else:
        i['balance'] += money
        print('თანხა ბალანსზე წარმატებით ჩაირიცხა')

    with open(file, mode='w', encoding='utf-8') as f:     # ვხსნით ფაილს წერის რეჟიმში და შეგვყავს შეცვლილი მონაცემები
        json.dump(data, f, indent=2, ensure_ascii=False)


def with_money():        # ამ ფუნქციით მომხმარებელს გამოაქვს ბალანსიდან თანხა
    withdraw = False
    while not withdraw:    # სანამ მომხმარებელი ბალანსიდან თანხას არ გამოიტანს ან სისტემიდან არ გამოვა while ციკლი იმუშავებს
        money = float(input('შეიყვანეთ ბალანსიდან გამოსატანი თანხა: '))
        if money > i['balance']:   # თუ მომხმარებელი იმაზე მეტ თანხას მიუთითებს ვიდრე ბალანსზე აქს, მას ეძლევა ორი არჩევანი
            print('ბალანსზე საკმარისი თანხა არ გაქვთ')                  # ახლიდან შეიყვანოს თანხა ან გამოვიდეს სისტემიდან
            a = input('თანხის ახლიდან შესაყვანად აირჩიეთ 1, სისტემიდან გასასვლელად აირჩიეთ 0: ')
            while a != '0' and a != '1':     # სანამ მომხმარებელი არ აირჩევს თავიდან შეიყვანოს თანხა თუ გამოვიდეს სისტემიდან
                a = input('გთხოვთ შეიყვანოთ მხოლოდ 1 ან 0: ')                      # while ციკლი იმუშავებს
            if a == '0':
                print('ოპერაცია დასრულებულია')
                sys.exit()

        else:
            i['balance'] -= money     # როდესაც მომხმარებელი სწორად შეიყვანს თანხას, თანხა ჩამოეჭრება ჩვეულებრივად ბალანსიდან
            print('თანხა ბალანსიდან წარმატებით გამოიტანეთ')
            withdraw = True
    with open(file, mode='w', encoding='utf-8') as f:     # ვხსნით ფაილს წაკითხვის რეჟიმში და შეგვყავს განახლებული მონაცემები
        json.dump(data, f, indent=2, ensure_ascii=False)

choice = ''       # მომხმარებელი ირჩევს რომელი ოპერაციის განხორციელება უნდა (ჩვენი დაწერილი სამი ფუნქციიდან),
while choice != '0':                           # მანამ, სანამ არ აირჩევს გამოსვლას და სისტემა არ შეწყვეტს მუშაობას
    choice = input('ბალანსის შესამოწმებლად აირჩიეთ 1, თანხის შესატანად აირჩიეთ 2, თანხის გამოსატანად აირჩიეთ 3, ' \
    'გასასვლელად აირჩიეთ 0: ')
    if choice == '1':
        check_balance()
    elif choice == '2':
        dep_money()
    elif choice == '3':
        with_money()
    elif choice == '0':
        print('ოპერაცია დასრულებულია')
        sys.exit()
    else:
        print('შეიყვანეთ მხოლოდ 1, 2 ან 3')


