# თამაში - Hangman

import random      # შემოვიტანეთ, სიტყვების სია, რომლიდანაც მოუწევს მომხმარებელს სიტყვის გამოცნობა
words_list = ["კომპიუტერი", "პროგრამისტი", "ცისარტყელა", "მზესუმზირა", "დელფინი", "კენგურუ",
"ტელეფონი", "ველოსიპედი", "ხელთათმანი", "აკვარიუმი", "კოსმოსი", "პირამიდა", "მყინვარწვერი",
"კლავიატურა", "ტელევიზორი", "ფანქარი", "რვეული", "ზურგჩანთა", "ვერტმფრენი"]

word = random.choice(words_list)    # მოგვცემს შემთხვევით სიტყვას ჩვენი სიიდან
hidden_word = '_' * len(word)      # მოგცემს ტირეების იმ რაოდენობას, რამდენი ასოც გვაქვს ჩვენს გამოსაცნობ სიტყვაში

print(f'გამარჯობა, ეს არის თამაში Hangman.\n'
      f'თქვენ უნდა გამოიცნოთ დაშიფრული სიტყვა: {hidden_word}\n'
      'სულ გაქვთ 10 მცდელობა.')

number_of_attempts = 1     # შემოგვაქვს ცვლადი მცდელობების დასათვლელად
guessed_letters = []     # შემოგვაქვს სია, გამოცნობილი ასოების ჩასაწერად, შემდგომი შემოწმებისთვის

while number_of_attempts <= 10:    # მცდელობების ამოწურვამდე ან სიტყვის გამოცნობამდე იმუშავებს while ოპერატორი
    a = input(f'ცდა {number_of_attempts}, თუ ასოს გამოცნობა გნებავთ აირჩიეთ 1, თუ პირდაპირ სიტყვას გამოიცნობთ აირჩიეთ 2: ')
    if a == '1':
        number_of_attempts += 1
        letter = input('შეიყვანეთ ასო: ')
        if letter in word:    # თუ მომხმარებელმა აირჩია ასოს გამოცნობა შემდეგ ვამოწმებთ არის თუ არა ეს ასო გამოსაცნობ სიტყვაში
            print(f'თქვენ გამოიცანით ასო {letter}')
            guessed_letters.append(letter)
        else:
            print(f'სამწუხაროდ ასო {letter} არ არის დაშიფრულ სიტყვაში')
    elif a == '2':
        guessed_word = input('შეიყვანეთ სიტყვა: ')
        if guessed_word == word:
            print(f'გილოცავთ თქვენ გამოიცანით სიტყვა {word}, დაგჭირდათ {number_of_attempts} მცდელობა')
            break     # თუ მომხმარებელმა პირდაპირ გამოიცნო სიტყვა, while ოპერატორი წყვეტს მუშაობას
        else:
            number_of_attempts += 1
            print('სამწუხაროდ თქვენ ვერ გამოიცანით სიტყვა')
    else:
        print('გთხოვთ შეიყვანოთ მხოლოდ 1 ან 2')

    h_word = ''   # შემოგვაქვს ცვლადი ახალი სიტყვის დასაგენერირებლად, რომელსაც ექნება ის ასოები, რაც გამოიცნო user-მა
    for i in word:                   # ვამოწმებთ თითოეულ ასოს გამოსაცნობ სიტყვაში, თუ დაემთხვა ჩვენს მიერ გამოცნობილ ასოს,
        if i in guessed_letters:     # რომელიც შენახული გვაქვს guessed_list-სიაში, მაგ ასოს ვწერთ, თუ არადა ასოს ნაცვლად ტირეს
            h_word += i
        else:
            h_word += '_'

    print(f'\n{h_word}\n')    # ვბეჭდავთ ბოლო შედეგებით სიტყვას ტირეებით და გამოცნობილი ასოებით

    if h_word == word:        # ვამოწმებთ, თუ ასოების გამოცნობით მთლიანად ავაწყვეთ სიტყვა, მაშინ მცდელობების რაოდენობებს
        number_of_attempts -= 1     # ვაკლებთ 1-ს, რადგან ასოს გამოცნობისას ავტომატურად ემატება და 1-ით ზედმეტი რომ არ გვქონდეს
        print(f'გილოცავთ თქვენ გამოიცანით სიტყვა {word}, დაგჭირდათ {number_of_attempts} მცდელობა')
        break      # ვბეჭდავთ, რომ user-მა გამოიცნო სიტყვა და გამოვდივართ ციკლიდან

if number_of_attempts > 10 and h_word != word:
    print('სამწუხაროდ, თქვენ ამოგეწურათ მცდელობების რაოდენობა და ვერ გამოიცანით სიტყვა')
    # თუ user-მა ამოწურა მცდელობების რაოდენობა, გამოვედით ციკლიდან და ვერ გამოიცნო სიტყვა, ვწერთ, რომ ვერ გამოიცნო
    # სიტყვა და პროგრამა ამთავრებს მუშაობას
