# თამაში - Hangman

stages = [r'''
  +---+
  |   |
  O   |
 /|\  |
 / \  |
      |
=========
''', r'''
  +---+
  |   |
  O   |
 /|\  |
 /    |
      |
=========
''', r'''
  +---+
  |   |
  O   |
 /|\  |
      |
      |
=========
''', r'''
  +---+
  |   |
  O   |
 /|   |
      |
      |
=========''', r'''
  +---+
  |   |
  O   |
  |   |
      |
      |
=========
''', r'''
  +---+
  |   |
  O   |
      |
      |
      |
=========
''', r'''
  +---+
  |   |
      |
      |
      |
      |
=========
''']

import random      # შემოვიტანეთ, სიტყვების სია, რომლიდანაც მოუწევს მომხმარებელს სიტყვის გამოცნობა
import re
words_list = ["კომპიუტერი", "პროგრამისტი", "ცისარტყელა", "მზესუმზირა", "დელფინი", "კენგურუ",
"ტელეფონი", "ველოსიპედი", "ხელთათმანი", "აკვარიუმი", "კოსმოსი", "პირამიდა", "მყინვარწვერი",
"კლავიატურა", "ტელევიზორი", "ფანქარი", "რვეული", "ზურგჩანთა", "ვერტმფრენი"]

word = random.choice(words_list)    # მოგვცემს შემთხვევით სიტყვას ჩვენი სიიდან
hidden_word = '_' * len(word)      # მოგცემს ტირეების იმ რაოდენობას, რამდენი ასოც გვაქვს ჩვენს გამოსაცნობ სიტყვაში
for_stages = -1                   # stages-იდან სხვადასხვა ელემენტის ამოსაღებად

print('გამარჯობა, ეს არის თამაში Hangman.\n')
print(stages[for_stages])
print(f'თქვენ უნდა გამოიცნოთ დაშიფრული სიტყვა: {hidden_word}\n')

number_of_attempts = 1     # შემოგვაქვს ცვლადი მცდელობების დასათვლელად
guessed_letters = []     # შემოგვაქვს სია, გამოცნობილი ასოების ჩასაწერად, შემდგომი შემოწმებისთვის
wrong_letters = []       # შემოგვაქვს სია არასწორად გამოცნობილი ასოებისთვის, შემდგომი შემოწმებისთვის

while for_stages != -7:    # stages-ების ამოწურვამდე ან სიტყვის გამოცნობამდე იმუშავებს while ოპერატორი
    a = input(f'ცდა {number_of_attempts}, თუ ასოს გამოცნობა გნებავთ აირჩიეთ 1, თუ პირდაპირ სიტყვას გამოიცნობთ აირჩიეთ 2: ')
    pattern = r'[ა-ჰ]+'      # შემოგვაქვს pattern, რომ შევამოწმოთ ყველა შეყვანილი ასო თუ სიტყვა არის ქართული ასოებით
    if a == '1':
        letter = input(f'\nშეიყვანეთ ასო: ')
        if not re.fullmatch(pattern, letter) or len(letter) > 1:  # თუ შეყვანილი მონაცემი არ არის 1 ქართული ასო, user-ს ვაძლევთ ინსტრუქციას
            print('\nგთხოვთ შეიყვანეთ მხოლოდ ერთი ქართული ასო\n')
        else:
            if letter in guessed_letters or letter in wrong_letters:    # ვამოწმებთ შეყვანილი ასო აქამდეც ხომ არ ჩაგვიწერია,
                    print(f'\nასო "{letter}" უკვე შეიყვანეთ, სცადეთ სხვა ასო\n')    # ტყუილად რომ არ მოგვემატოს ცდების რაოდენობა
            else:
                if letter in word:                          # ვამოწმებთ არის თუ არა user_ის შეყვანილი ასო გამოსაცნობ სიტყვაში
                    print(f'\nგილოცავთ თქვენ გამოიცანით ასო "{letter}"')
                    print(stages[for_stages])
                    guessed_letters.append(letter)
                    number_of_attempts += 1
                else:
                    print(f'\nსამწუხაროდ ასო "{letter}" არ არის დაშიფრულ სიტყვაში')
                    for_stages -= 1         # ვაკლებთ, რომ stages-ის სიის სხვა ელემენტი წამოვიღოთ (კაცუნა რომ ჩამოვახჩოთ)
                    print(stages[for_stages])
                    wrong_letters.append(letter)
                    number_of_attempts += 1
    elif a == '2':
        guessed_word = input('\nშეიყვანეთ სიტყვა: ')
        if not re.fullmatch(pattern, guessed_word):
            print('\nგთხოვთ შეიყვანეთ სიტყვა მხოლოდ ქართული ასოებით\n')
        else:
            if guessed_word == word:
                print(f'\nგილოცავთ თქვენ გამოიცანით სიტყვა "{word}", დაგჭირდათ {number_of_attempts} მცდელობა')
                break     # თუ მომხმარებელმა პირდაპირ გამოიცნო სიტყვა, while ოპერატორი წყვეტს მუშაობას
            else:
                number_of_attempts += 1
                print('\nსამწუხაროდ თქვენ ვერ გამოიცანით სიტყვა')
                for_stages -= 1
                print(stages[for_stages]) # თუ მომხმარებელმა ვერ გამოიცნო სიტყვა, ითვლება ჩვეულებრივ შეცდომად და თამაში გრძელდება
    else:
        print('\nგთხოვთ შეიყვანოთ მხოლოდ 1 ან 2\n')

    h_word = ''   # შემოგვაქვს ცვლადი ახალი სიტყვის დასაგენერირებლად, რომელსაც ექნება ის ასოები, რაც გამოიცნო user-მა
    for i in word:                   # ვამოწმებთ თითოეულ ასოს გამოსაცნობ სიტყვაში, თუ დაემთხვა ჩვენს მიერ გამოცნობილ ასოს,
        if i in guessed_letters:     # რომელიც შენახული გვაქვს guessed_list-სიაში, მაგ ასოს ვწერთ, თუ არადა ასოს ნაცვლად ტირეს
            h_word += i
        else:
            h_word += '_'

    print(f'დაშიფრული სიტყვა: {h_word}\n')    # ვბეჭდავთ ბოლო შედეგებით სიტყვას ტირეებით და გამოცნობილი ასოებით

    if h_word == word:        # ვამოწმებთ, თუ ასოების გამოცნობით მთლიანად ავაწყვეთ სიტყვა, მაშინ მცდელობების რაოდენობებს
        number_of_attempts -= 1     # ვაკლებთ 1-ს, რადგან ასოს გამოცნობისას ავტომატურად ემატება და 1-ით ზედმეტი რომ არ გვქონდეს
        print(f'გილოცავთ თქვენ გამოიცანით სიტყვა {word}, დაგჭირდათ {number_of_attempts} მცდელობა')
        break      # ვბეჭდავთ, რომ user-მა გამოიცნო სიტყვა და გამოვდივართ ციკლიდან

if for_stages == -7 and h_word != word:
    print(f'\nსამწუხაროდ, თქვენ ამოგეწურათ მცდელობების რაოდენობა და ვერ გამოიცანით სიტყვა "{word}".')
    # თუ user-მა ამოწურა stages-ების რაოდენობა, გამოვედით ციკლიდან და ვერ გამოიცნო სიტყვა, ვწერთ, რომ ვერ გამოიცნო
    # სიტყვა და პროგრამა ამთავრებს მუშაობას
